app/controllers/recipes_controller.rb

  def show
    @recipe = Recipes.find(params[:id])
---
SELECT * FROM "recipes" WHERE ("recipes"."id" = 1)